Soway-code/Module_Lib/GD32F103CB_RS485_APP5-13/APP/inc/includes.h
#ifndef  __INCLUDES_H
#define  __INCLUDES_H
#include "gd32f10x.h"
//定义一些常用的数据类型短关键字 
typedef int64_t  s64;
typedef int32_t  s32;
typedef int16_t  s16;
typedef int8_t   s8;

typedef const int32_t sc32;  
typedef const int16_t sc16;  
typedef const int8_t sc8;  

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  
typedef __I int16_t vsc16; 
typedef __I int8_t vsc8;   

typedef uint64_t  u64;
typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  
typedef const uint16_t uc16;  
typedef const uint8_t uc8; 

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  
typedef __I uint16_t vuc16; 
typedef __I uint8_t vuc8;  


#include "stdint.h"
#include "stdbool.h"
#include "type.h"
#include  "Modbus.h"
#include  "UserApp.h"
#include "Baseincludes.h"
#include  "string.h"
#include "algorithm.h"
#include "GD32F103_Systick.h"
#include <core_cm3.h>
#include "GD_FlashApp.h"
//#include "Dmaconfig.h"
//#include  "usart.h"

#endif
